{
    "start": {
        "description": "You stand before an ancient cave mouth, its weathered stones covered in mysterious glyphs that seem to pulse with a faint inner light. A cool breeze carries the scent of earth and something... magical. Two paths stretch before you into the darkness.",
        "choices": [
            {
                "text": "Take the left path, where ethereal blue crystals cast dancing shadows on the walls",
                "next": "blue_path"
            },
            {
                "text": "Take the right path, where ancient stone steps spiral into the depths",
                "next": "deep_cave"
            }
        ]
    },
    "blue_path": {
        "description": "The blue crystals illuminate the passage like frozen stars. Their light pulses in rhythm with your heartbeat, and whispers of ancient magic tingle against your skin. The air here feels charged with possibility.",
        "choices": [
            {
                "text": "Reach out to touch a crystal, drawn by its mesmerizing glow",
                "next": "crystal_room"
            },
            {
                "text": "Follow the crystal-lit path deeper into the cave's mysteries",
                "next": "underground_lake"
            }
        ]
    },
    "deep_cave": {
        "description": "The stone steps wind downward in a dizzying spiral. Strange echoes bounce off the walls - sometimes like whispered conversations, other times like distant music. The air grows warmer, and you smell something that reminds you of lightning before a storm.",
        "choices": [
            {
                "text": "Follow the haunting echoes to their source",
                "next": "echo_chamber"
            },
            {
                "text": "Look for markings or signs of another route",
                "next": "hidden_passage"
            }
        ]
    },
    "crystal_room": {
        "description": "As you reach for a crystal, the whole room begins to shimmer. The crystals seem to respond to your presence.",
        "choices": [
            {
                "text": "Channel the crystal's energy",
                "next": "magic_ending"
            },
            {
                "text": "Retreat from the room",
                "next": "blue_path"
            }
        ]
    },
    "underground_lake": {
        "description": "You discover a vast underground lake. Something seems to be moving beneath the surface.",
        "choices": [
            {
                "text": "Try to cross the lake",
                "next": "lake_crossing"
            },
            {
                "text": "Search for another path",
                "next": "hidden_passage"
            }
        ]
    },
    "magic_ending": {
        "description": "As your fingers touch the crystal, ancient magic surges through your body like liquid starlight. Your mind expands, touching centuries of forgotten knowledge. You understand now - the cave wasn't just a place, it was a test. You have proven worthy of becoming a guardian of its ancient secrets. The power of the crystals is yours to command, but with it comes the responsibility to protect this sacred place."
    },
    "lake_crossing": {
        "description": "Using a combination of courage and ingenuity, you navigate across the mirror-like lake. On the far shore, you discover an ornate chest made of opalescent metal. Inside lies not gold, but something far more valuable - an ancient spellbook and a crystal key that thrums with power. You've found not just treasure, but a gateway to a larger world of magic."
    },
    "hidden_passage": {
        "description": "Behind a cascade of phosphorescent moss, you discover runes carved into the wall. As you trace them with your finger, a section of stone dissolves like mist, revealing a secret tunnel. While this path leads you safely to the surface, you know you've only scratched the surface of the cave's mysteries. Perhaps one day you'll return, better prepared for its wonders and dangers."
    },
    "echo_chamber": {
        "description": "The chamber opens before you like a cathedral carved by time itself. The walls are covered in intricate hieroglyphs that tell the story of an advanced civilization that learned to blend magic and science. As you study them, the echoes coalesce into clear voices, sharing secrets of their lost knowledge. You've not only discovered history - you've become part of it."
    }
} 